================================================================================
Empty Map
================================================================================

{}

--------------------------------------------------------------------------------

(source 0..2         
  (braces 0..2 '{}'))

================================================================================
Simple Map
================================================================================

{:a 1 :b 2}

--------------------------------------------------------------------------------

(source 0..11          
  (braces 0..11        
    (token 1..3 ':a')  
    (token 4..5 '1')   
    (token 6..8 ':b')  
    (token 9..10 '2')))

================================================================================
Deeper Map
================================================================================

{:paths ["src"]
 :deps {clj-kondo/clj-kondo {:mvn/version "2020.09.09"}}}

--------------------------------------------------------------------------------

(source 0..73                             
  (braces 0..73                           
    (token 1..7 ':paths')                 
    (brackets 8..15                       
      (str_lit 9..14                      
        (body 10..13 'src')))             
    (token 17..22 ':deps')                
    (braces 23..72                        
      (token 24..43 'clj-kondo/clj-kondo')
      (braces 44..71                      
        (token 45..57 ':mvn/version')     
        (str_lit 58..70                   
          (body 59..69 '2020.09.09')))))) 

================================================================================
Map with Comma
================================================================================

{:x 1,
 :y 2}

--------------------------------------------------------------------------------

(source 0..13           
  (braces 0..13         
    (token 1..3 ':x')   
    (token 4..5 '1')    
    (token 8..10 ':y')  
    (token 11..12 '2')))

================================================================================
Empty Set
================================================================================

#{}

--------------------------------------------------------------------------------

(source 0..3           
  (braces 0..3         
    (marker 0..1 '#')))

================================================================================
Simple Set
================================================================================

#{:i :j :k}

--------------------------------------------------------------------------------

(source 0..11           
  (braces 0..11         
    (marker 0..1 '#')   
    (token 2..4 ':i')   
    (token 5..7 ':j')   
    (token 8..10 ':k')))

================================================================================
Nested Sets
================================================================================

#{#{1} #{#{0} 2}}

--------------------------------------------------------------------------------

(source 0..17              
  (braces 0..17            
    (marker 0..1 '#')      
    (braces 2..6           
      (marker 2..3 '#')    
      (token 4..5 '1'))    
    (braces 7..16          
      (marker 7..8 '#')    
      (braces 9..13        
        (marker 9..10 '#') 
        (token 11..12 '0'))
      (token 14..15 '2'))))
