================================================================================
Simple String
================================================================================

"hello there"

--------------------------------------------------------------------------------

(source 0..13                     
  (str_lit 0..13 '"hello there"'))

================================================================================
String with Escapes
================================================================================

"first line\nsecond\tline"

--------------------------------------------------------------------------------

(source 0..26                                  
  (str_lit 0..26 '"first line\nsecond\tline"'))

================================================================================
Multiline String
================================================================================

"this is the first line
and what is this one?"

--------------------------------------------------------------------------------

(source 0..46                                                       
  (str_lit 0..46 '"this is the first line\nand what is this one?"'))


================================================================================
Empty String
================================================================================

""

--------------------------------------------------------------------------------

(source 0..2
  (str_lit 0..2 '""'))

================================================================================
String with escaped quote
================================================================================

"abc\"def"

--------------------------------------------------------------------------------

(source 0..10                  
  (str_lit 0..10 '"abc\"def"'))

================================================================================
String with double escaped quote
================================================================================

"abcdef\\"

--------------------------------------------------------------------------------

(source 0..10                  
  (str_lit 0..10 '"abcdef\\"'))
