================================================================================
Simple Symbol
================================================================================

def

--------------------------------------------------------------------------------

(source 0..3            
  (sym_lit 0..3         
    (sym_name 0..3 'def')))

================================================================================
Symbol with Prefix
================================================================================

clojure.string/blank?

--------------------------------------------------------------------------------

(source 0..21                   
  (sym_lit 0..21                
    (sym_ns 0..14 'clojure.string')
    (sym_name 15..21 'blank?')))

================================================================================
Division Symbol
================================================================================

/

--------------------------------------------------------------------------------

(source 0..1          
  (sym_lit 0..1       
    (sym_name 0..1 '/')))

================================================================================
Namespaced Division Symbol
================================================================================

clojure.core//

--------------------------------------------------------------------------------

(source 0..14                 
  (sym_lit 0..14              
    (sym_ns 0..12 'clojure.core')
    (sym_name 13..14 '/')))

================================================================================
Division Symbol followed by delimiter
================================================================================

(+ - * /)

--------------------------------------------------------------------------------

(source 0..9             
  (parens 0..9           
    (sym_lit 1..2        
      (sym_name 1..2 '+'))  
    (sym_lit 3..4        
      (sym_name 3..4 '-'))  
    (sym_lit 5..6        
      (sym_name 5..6 '*'))  
    (sym_lit 7..8        
      (sym_name 7..8 '/'))))
